test_cases/2d_water/0.6mmHotWaterNozzle_kEps_2D_sealConstants/constant/sealConstants
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          sealConstants;
}


// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


slRelaxation                   slRelaxation [0 0 1 0 0 0 0]  5e-3;     //Time relaxation factor [s] for releasing seal, smaller is quicker
drag                           drag         [0 0 1 0 0 0 0]  1e-7;     //Drag constant, smaller is more aggressive 
lowerCorner                    (0.0115 -0.0005 -0.0005);              //bounding box lower corner [x y z]
upperCorner                    (0.0125 0.0005 0.0005);              //bounding box upper corner [x y z]
triggerDisp                    triggerDisp  [0 0 0 0 0 0 0] 0;         //needle displacement for seal toggle, dimensions of length in real life
sealWithStaticMesh             yes;                                     //set 'yes' to enforce sealing without a dynamic mesh

// ************************************************************************* //

