test_cases/2d_water/0.6mmHotWaterNozzle_kEps_2D_sealConstants/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          controlDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application 	HRMFoam;

startFrom       latestTime;

startTime       0.0;

stopAt          endTime;

endTime         3e-1;

deltaT          1e-7;

maxDeltaT	1e-6;

writeControl    adjustableRunTime;
writeInterval   1e-4;

//writeControl    timeStep;
//writeInterval   50;

purgeWrite      0;

writeFormat     binary;

writePrecision  7;

writeCompression off;

timeFormat      general;

adjustTimeStep  yes;

maxCo           1.2;

timePrecision   6;

runTimeModifiable yes;

// ************************************************************************* //
